Repository: come219/flutter_aws_lambda_demo
Catalog: lib/l10n/app_*.arb
Languages: th

source: Hello World!
th: เฮโหล เวิร์ด!

source: Connection error.
th: พบความผิดพลาดในการเชื่อมต่อ

source: Retry
th: ลองใหม่

source: Details
th: รายละเอียด

source: Description
th: คำอธิบาย

source: Festival
th: เทศกาล

source: Healthcare
th: การดูแล

source: Health
th: สุขภาพ

source: Magazine
th: นิตยสาร

source: Logout
th: ออกจากระบบ

source: Login
th: เข้าสู่ระบบ

source: Terms & conditions
th: ข้อกำหนดและเงื่อนไข

source: Return & refund
th: ส่งคืนและคืนเงิน

source: Privacy policy
th: นโยบายความเป็นส่วนตัว

source: Contact us
th: ติดต่อเรา

source: The company
th: เกี่ยวกับเรา

source: Profile
th: โปรไฟล์

source: Insurance
th: ประกันชีวิต

source: Subscription
th: สมัตรสมาชิก

# perMonth
source: / month
th: ต่อเดือน

# perYear
source: / year
th: /ปีี

source: READ MORE
th: ดูรายละเอียด

source: OK
th: ตกลง

# errorOccurred
source: An Error Occurred.
th: เกิดข้อผิดพลาด

# unexpectedError
source: An unexpected error has occurred. Please retry your request later.
th: เกิดข้อผิดพลาด โปรดลองใหม่ภายหลัง

# userNotFound
source: No account was found matching that email and password.
th: ไม่พบผู้ใช้สำหรับอีเมลหรือรหัสผ่านนี้

# emailAlreadyUsed
source: This email is already used.
th: อีเมลนี้ถูกใช้งานแล้ว

source: Success
th: สำเร็จ

# registrationSuccess
source: Congratulations, your account has been successfully created.
th: สมัครสมาชิกสำเร็จ

# subscribeToLetter
source: Subscribe to our newsletter.
th: รับข่าวสารจากทางเรา

source: View All >
th: ดูทั้งหมด >

source: From
th: จาก

source: Features
th: ฟีเจอร์

source: Profile details
th: ข้อมูลโปรไฟล์

source: First Name
th: ชื่อจริง

source: Last Name
th: นามสกุล

source: Email
th: อีเมล

source: Submit
th: ส่ง

source: Cancel
th: ยกเลิก

source: Signup
th: สมัครสมาชิก

source: Password
th: รหัสผ่าน

source: Confirm password
th: ยืนยันรหัสผ่าน

source: Edit
th: แก้ไข

source: Settings
th: ตั้งค่า

source: Address
th: ที่อยู่

source: Notifications
th: การแจ้งเตือน

# securityAndPrivacy
source: Security & Privacy
th: ความปลอดภัยและความเป็นส่วนตัว

source: Privacy settings
th: ตั้งค่าความเป็นส่วนตัว

source: Delete my account
th: ลบบัญชีผู้ใช้

source: Language
th: ภาษา

source: Current password
th: รหัสผ่านปัจจุบัน

source: New password
th: รหัสผ่านใหม่

# wrongCurrentPassword
source: Provided password is different than the current one.
th: รหัสผ่านปัจจุบันไม่ถูกต้อง

# changePasswordSuccess
source: You can now use new password to login.
th: คุณสามารถใช้รหัสผ่านใหม่ในการล็อคอินได้ทันที

source: Product
th: สินค้า

source: Free shipping
th: จัดส่งฟรี

source: Choose your plan
th: เลือกแผนของคุณ

source: What is your pet's name?
th: สัตว์เลี้ยงของคุณชื่ออะไร?

source: Add to cart
th: เพิ่มลงตะกร้า

# startFrom
source: From
th: เริ่มต้นที่

source: reviews
th: รีวิว

source: Choose pet
th: เลือกสัตว์เลี้ยง

# defaultText
source: Default
th: ค่าเริ่มต้น

source: Delete
th: ลบ

source: Set default
th: ตั้งเป็นค่าเริ่มต้น

source: Add new address
th: เพิ่มที่อยู่ใหม่

source: Country
th: ประเทศ

source: Choose country
th: เลือกประเทศ

source: Province
th: จังหวัด

source: Choose province
th: เลือกจังหวัด

source: Company
th: บริษัท

source: Street
th: ถนน

source: City
th: แขวง/อำเภอ

source: Postcode
th: รหัสไปรษณีย์

source: Phone number
th: เบอร์โทรศัพท์

source: About us
th: เกี่ยวกับเรา

source: Name
th: ชื่อ

source: Subject
th: หัวข้อ

source: Message
th: ข้อความ

# contactSuccess
source: Thank you for getting in touch! We appreciate you contacting us Myfriend. One of our colleagues will get back in touch with you soon!
th: ขอบคุณทีสำหรับการติดต่อ ทางเรา Myfriend ยินดีให้บริการคุณ ทางเราจะติดต่อกลับไปโดยเร็วที่สุด!

source: General inquiry
th: ติดต่อทั่วไป

source: Question
th: ข้อสอบถาม

source: Feedback
th: ข้อคิดเห็น

source: Other
th: อื่นๆ

source: My pets
th: สัตว์เลี้ยงของฉัน

source: Add new pet
th: เพิ่มสัตว์เลี้ยงใหม่

source: Pet name
th: ชื่อสัตว์เลี้ยง

source: Upload photos
th: อัปโหลดรูป

source: Specie
th: สปีชีส์

source: Breed
th: พันธุ์

source: Gender
th: เพศ

source: Color
th: สี

source: Date of birth
th: วันเกิด

source: Bio
th: ประวัติ

source: Microchip
th: ไมโครชิพ

source: Male
th: เพศผู้

source: Female
th: เพศเมีย

source: Year
th: ปี

source: Years
th: ปี

source: Main Info
th: ข้อมูลทั่วไป

source: Care Info
th: ข้อมูลการดูแล

source: Measurement
th: การวัด

source: Measurements
th: ข้อมูลการวัด

source: Menstruation
th: ข้อมูลประจำเดือน

source: Vaccination
th: ข้อมูลการฉีดวัคซีน

source: Vaccinations
th: ข้อมูลการฉีดวัคซีน

source: Allergy
th: ข้อมูลการแพ้

source: Allergies
th: ข้อมูลการแพ้

source: Medication
th: ข้อมูลการรับประทานยา

source: Medications
th: ข้อมูลการรับประทานยา

source: Maintenance
th: ข้อมูลการดูแลรักษา

source: Feeding schedule
th: ตารางการให้อาหาร

# feedingScheduleDescription
source: Once/Twice a day
th: ครั้ง/สองครั้ง ต่อวัน

source: Can be left alone?
th: สามารถทิ้งไว้ลำพัง?

# canBeLeftAloneDescription
source: Yes/No
th: ใช่/ไม่

source: Pet energy level
th: เพิ่มพลังงานของสัตว์เลี้ยง

# petEnergyLevelDescription
source: 1 = always sleepy, 5 = hyperactive.
th: 1 = ง่วงนอนตลอดเวลา, 5 = ตื่นตัวอย่างมาก

source: Toilet break schedule
th: เพิ่มตารางการขับถ่าย

# toiletBreakScheduleDescription
source: How many times a break is needed during a day.
th: จำนวนครั้งที่ต้องการในแต่ล่ะวัน

source: Photos
th: รูปภาพ

source: Alert!
th: คำเตือน!

source: Confirm
th: ยืนยัน

# removeImageConfirm
source: Are you sure you want to remove this image?
th: คุณต้องการที่จะลบรูปภาพนี้?

source: Current photos
th: รูปภาพปัจจุบัน

source: New photos
th: รูปภาพใหม่

source: Please select
th: โปรดเลือก

# addLifeEvent
source: Add a pet fact
th: เพิ่มข้อมูลใหม่ของสัตว์เลี้ยง

# editLifeEvent
source: Edit pet fact
th: แก้ไขข้อมูลของสัตว์เลี้ยง

source: Type of event
th: ประเภทของอีเวนท์

source: Date
th: วันที่

source: Weight
th: น้ำหนัก

source: Height
th: ส่วนสูง

source: Temperature
th: อุณหภูมิ

source: Estrous status
th: สถานะการเป็นสัด

source: Estrous end date
th: วันที่หมดการเป็นสัด

source: Periodic date
th: วันที่เริ่มประจำเดือน

source: Periodic date next
th: วันที่เริ่มประจำเดือนครั้งต่อไป

source: Allergy category
th: ประเภทการแพ้

source: Allergy severity
th: ความรุนแรงของการแพ้

source: Medication mode
th: รูปแบบของยา

source: Medication dosage
th: ปริมาณยา

source: Medication severity
th: ความรุนแรงของยา

source: Medication frequency
th: ความถี่ของการให้ยา

source: Medication repeat
th: ให้ยาซ้ำ

source: Medication repeat every
th: ให้ยาซ้ำทุก

source: Medication count
th: จำนวนครั้งที่ให้ยา

# removePetConfirm
source: Are you sure you want to remove this pet?
th: คุณต้องการที่จะลบสัตว์เลี้ยงนี้?

source: Pet profile
th: โปรไฟล์สัตว์เลี้ยง

# petProfileDescription
source: Don't forget to add your pet(s) profile(s) in order to use the full Healthcare Feature.
th: อย่าลืมเพิ่มโปรไฟล์สัตว์เลี้ยง เพื่อให้ได้งานฟีเจอร์ได้ครบถ้วน

source: Month
th: เดือน

source: Months
th: เดือน

source: Week
th: สัปดาห์

source: Day
th: วัน

source: Filter
th: ตัวกรอง

source: My Cart
th: ตะกร้าสินค้า

source: CHECK OUT
th: เช็คเอาท์

source: Shop
th: ร้านค้า

source: All Products
th: สินค้าทั้งหมด

source: Promotion
th: โปรโมชั่น

source: Piece
th: ชิ้น

source: View cart
th: ดูตะกร้า

# loginToAddProduct
source: You need to login in order to add product to cart.
th: คุณจำเป็นต้องเข้าสู่ระบบเพื่อเพิ่มสินค้าลงตะกร้า

source: Payment
th: ชำระเงิน

source: Continue to payment
th: ดำเนินการชำระเงิน

source: Back to shopping
th: กลับไปยังหน้าร้านค้า

source: Select address
th: เลือกที่อยู่

source: Please select address.
th: โปรดเลือกที่อยู่

# cardNumber
source: Number
th: หมายเลขบัตร

source: Expired Date
th: วันที่หมดอายุ

source: CVV
th: รหัสความปลอดภัย

source: Card Holder
th: ชื่อผู้ถือบัตร

# pleaseFillCard
source: Please fill card info.
th: โปรดกรอกข้อมูลบัตรให้ถูกต้อง

source: Order complete
th: การสั่งซื้อประสบความสำเร็จ

# orderCompleteDetail
source: Your order has been confirmed and on the way to you!
th: คำสั่งซื้อของคุณได้รับการยืนยันการชำระเงินและกำลังจะจัดส่งถึงคุณ

source: Order Details
th: รายละเอียดคำสั่งซื้อ

source: My schedule
th: ปฏิทินของฉัน

source: My orders
th: คำสั่งซื้อของฉัน

# alreadyHaveAccount
source: Already have an account?
th: มีบัญชีผู้ใช้อยู่แล้ว?

# dontHaveAccount
source: Don't have an account?
th: ยังไม่มีบัญชีผู้ใช้

source: Forgot your password?
th: ลืมรหัสผ่านของคุณ?

source: Reset
th: รีเซ็ท

# userNotFoundEmail
source: User not found for this email.
th: ไม่พบผู้ใช้สำหรับอีเมลนี้

source: New password on the way!
th: รหัสผ่านใหม่กำลังไป!

# checkYourEmailForReset
source: Check your email for the link to reset your password.
th: โปรดเช็คอีเมลของคุณสำหรับลิงก์เพื่อรีเซ็ทรหัสผ่าน

source: Proceed to Login
th: ไปยังหน้าเข้าสู่ระบบ

source: Payment info
th: ข้อมูลการชำระเงิน

# itemTotalPrice
source: Item total
th: ราคาสินค้า

# shippingPrice
source: Shipping
th: ราคาจัดส่ง

source: Total
th: ทั้งหมด

source: Order info
th: ข้อมูลคำสั่งซื้อ

source: Shipping info
th: ข้อมูลการจัดส่ง

source: Shipping status
th: สถานะการจัดส่ง

source: Shipping method
th: วิธีการจัดส่ง

source: Tracking number
th: หมายเลขติดตามการจัดส่ง

source: Ready
th: รอการจัดส่ง

source: Shipped
th: จัดส่งแล้ว

source: Copied!
th: บันทึกแล้ว!

source: Product added to cart!
th: สินค้าถูกเพิ่มไปยังตะกร้า!

source: Add to my calendar
th: เพิ่มลงในปฏิทิน

# profileGreeting
source: Hey there!
th: สวัสดี!

source: Login now,
th: เข้าสู่ระบบเลยตอนนี้,

source: Don't receive email?
th: ไม่ได้รับอีเมลใช่ไหม?

source: Request again
th: ส่งอีกครั้ง

# resetCode
source: Reset token
th: รหัสรีเซ็ท

source: Ready to go
th: พร้อมแล้ว

# passwordIsSet
source: Now that your password is set, it's time to continue to login.
th: รหัสผ่านได้ถูกตั้งใหม่เรียบร้อยแล้ว ได้เวลาเข้าสู่ระบบ

# tokenInvalid
source: Invalid token, please check that you have correct token from email.
th: รหัสรีเซ็ทไม่ถูกต้อง โปรดตรวจสอบว่าคุณได้รับรหัสที่ถูกต้องทางอีเมลของคุณ

source: scheduled events
th: อีเวนท์ในปฏิทิน

source: Add event
th: เพิ่มอีเวนท์

source: Edit event
th: แก้ไขอีเวนท์

source: Title
th: หัวข้อ

source: Event
th: อีเวนท์

source: Events
th: อีเวนท์

source: Event title
th: หัวข้ออีเวนท์

source: Category
th: หมวดหมู่

source: Pet
th: สัตว์เลี้ยง

source: Start date
th: วันเริ่มต้น

source: End date
th: วันสิ้นสุด

source: Select date
th: เลือกวัน

source: Select time
th: เลือกเวลา

source: Start time
th: เวลาเริ่มต้น

source: End time
th: เวลาสิ้นสุด

source: End date should be after start date
th: วันสิ้นสุดควรอยู่หลังวันเริ่มต้น

source: Choose event category
th: เลือกหมวดหมู่อีเวนท์

source: Please input this field
th: กรุณากรอกช่องนี้

source: All
th: ทั้งหมด

source: Clear filters
th: ล้างตัวกรอง

# invalidCard
source: Card number is invalid or brand not supported.
th: หมายเลขบัตรไม่ถูกต้องหรือไม่รองรับ

# invalidArea
source: Sorry we cannot ship to your province
th: เราไม่สามารถจัดส่งไปยังจังหวัดของคุณได้

# loginTerms
source: By logging in and/or registering you accept our
th: การเข้าสู่ระบบหรือสมัครสมาชิก หมายความว่าคุณได้ยอมรับ

source: Add
th: เพิ่ม

# blog
source: Articles
th: บทความ

# blogs
source: Articles
th: บทความ

source: Given date
th: วันที่ฉีด

source: Due next
th: วันที่ต่อไป

source: Take a photo
th: ถ่ายรูป

source: Select from gallery
th: เลือกจากคลัง

# sessionExpiredDescription
source: Session expired. Please login again.
th: เซสชั่นหมดอายุ โปรดเข้าสู่ระบบใหม่อีกครั้ง

# noNotification
source: Notification not found.
th: ไม่พบการแจ้งเตือนของคุณ

source: Estrous cycle
th: วัฏจักรการเป็นสัด

source: Notes
th: บันทึกช่วยจำ

source: Type of vaccination
th: ประเภทของวัคซีน

source: Actions taken
th: สิ่งที่ต้องทำ

source: Name of medication
th: ชื่อของยา

source: Periodic Maintenance
th: ประเภทการบำรุงรักษา

source: Need Help
th: ต้องการความช่วยเหลือ

# needHelpDescription
source: Have issues creating your pet's profile? Do you feel there's a missing feature? We are here to assist you in every way possible. Contact us by email
th: พบปัญหาในการสร้างโปรไฟล์สัตว์เลี้ยง? คิดว่ามีฟีเจอร์ที่ขาดหายไป? เราพร้อมที่จะช่วยเหลือในทุกขั้นตอนที่เป็นไปได้ ติดต่อเราทางอีเมล

# useTheForm
source: or use the form
th: หรือใช้ฟอร์มของเรา

source: Here
th: ที่นี่

source: Share Pet Details
th: แชร์ข้อมูล​สัตว์เลี้ยง

# shareLinkBelow
source: Share the link below to grant access to the details you have selected.
th: แชร์ลิ้งค์ด้านล่างเพื่อเข้าถึงข้อมูลรายละเอียด​ต่างๆที่คุณเลือก

source: Select what to share
th: เลือกข้อมูล​ที่ต้องการแชร์

source: Share
th: แชร์

source: Exit
th: ออก

source: Get Link
th: รับลิงค์

source: Copy Link
th: คัดลอกลิ้งค์

# noInfoSelected
source: No items are selected
th: คุณยังไม่ได้เลือกข้อมูล​

# selectAtLeast
source: Please select at least one item.
th: กรุณาเลือกข้อมูล​อย่างน้อยหนึ่งข้อ​

source: Update Available
th: อัปเดตแอปพลิเคชัน

# newAppVersion
source: A new version is available. Would you like to update now?
th: แอปพลิเคชันมีเวอร์ชันใหม่ อัปเดตตอนนี้เลยไหม?

source: Places
th: สถานที่

source: Travel
th: การท่องเที่ยว

source: Subscriptions
th: ของใช้สัตว์เลี้ยง

source: Services
th: บริการ

# outOfStock
source: The item is out of stock
th: สินค้าหมดค่ะ

# viewOrAddPets
source: View or add your pets
th: ดูหรือเพิ่มสัตว์เลี้ยงของคุณ

source: Check what is new
th: อัปเดตแอปพลิเคชัน

# caphere
source: HERE
th: ที่นี่

source: Maybe Later
th: ไว้ทีหลัง

source: Update Now
th: อัปเดต

# shopTexts
source: Discover our Shop with pet food and accessories for your paw friends!
th: ค้นหาอาหารและของใช้สัตว์เลี้ยงใน Shop ของเราเพื่อเจ้าน้องของคุณ!

# shopButton
source: Go to the Shop
th: ไปที่ร้านค้า

# insuranceButton
source: Protect your Pet
th: ปกป้องสัตว์เลี้ยง

source: No Pet Chosen
th: ไม่ได้เลือกสัตว์เลี้ยง

# areYouSureYourEmail
source: An unexpected error has occurred. Are you sure your email is not already registered?
th: เกิดข้อผิดพลาด คุณแน่ใจหรือว่าอีเมลของคุณยังไม่ได้ลงทะเบียน?

# getQuote
source: Get a quote
th: ขอดูเบี้ยประกัน

# rabiesVaccine
source: Rabies Vaccination
th: วัคซีนป้องกันโรคพิษสุนัขบ้า

source: Upload Photo of Vaccination
th: อัปโหลดหลักฐานการฉีดวัคซีน

source: Upload Photo
th: อัปโหลดรูปภาพ

source: Check In
th: เช็คอิน

source: Smart Check-In
th: สมาร์ทเช็คอิน

source: Pet-Friendly Parks
th: สวนสาธารณะที่สัตว์เลี้ยงเข้าได้

source: Select Pets
th: เลือกสัตว์เลี้ยง

source: Your Pets
th: สัตว์เลี้ยงของคุณ

source: Pets checked-in now
th: สัตว์เลี้ยง เช็คอินแล้ว

# addPetsToListTo
source: Add your pets to the list to check them in
th: เพิ่มสัตว์เลี้ยงในลิสต์เพื่อเช็คอิน

# toHelpUsMaintain
source: To help us maintain the park clean and provide the best services to you, please remember to check out once you leave the park.
th: ช่วยพวกเรารักษาความสะอาดในสวน เราจะได้มีพื้นที่ดี ๆ ให้น้อง ๆ มาวิ่งเล่นกันนะ และ อย่าลืมเช็คเอาท์ก่อนออกจากสวนด้วยล่ะ

source: Checked-In!
th: เช็คอินแล้ว!

# thankYouForVisiting
source: Thanks for visiting and bringing your pets!
th: ขอบคุณที่มาเยี่ยมสวนและพาน้อง ๆ มาเที่ยวเล่นนะ!

source: Scan QR Code
th: สแกน QR Code

source: Time you have been
th: เวลาตั้งแต่การเช็คอิน

# checkedInSentence
source: checked-in
th: เช็คอินเรียบร้อยแล้ว

source: Checked-out
th: เช็คเอาท์สำเร็จ

source: Add Pets
th: เพิ่มสัตว์เลี้ยง

source: ADD PET
th: เพิ่มสัตว์เลี้ยง

source: Got it
th: รับทราบ

source: Add more
th: เพิ่มสัตว์เลี้ยง

# areYouSureDelete
source: Are you sure you want to delete this account?
th: คุณแน่ใจแล้วใช่มั้ยที่จะลบบัญชีนี้ออก?

# pleaseUploadPark
source: Please upload the following documents to check into the park.
th: อัปโหลดข้อมูลเพื่อเช็คอินเข้าสวนสาธารณะ

source: Your pet's photo
th: รูปภาพสัตว์เลี้ยง

# yourPetsRabies
source: Your pet's Rabies vaccination card
th: หลักฐานการฉีดวัคซีนพิษสุนัขบ้า

# mustVacc48
source: You must upload vaccination proof within 48 hours after your first check-in.
th: ต้องอัปโหลดหลักฐานการฉีดวัคซีนได้ใน 48 ชั่วโมงหลังการเช็คอินครั้งแรก

# checkinInfoMiss
source: Check-in Information missing
th: ข้อมูลเช็คอินยังไม่ครบ

# checkinRequirements
source: Mandatory requirements
th: ข้อมูลที่จำเป็น

# photoRequirement
source: Photo of your pet uploaded in your pet profile
th: รูปภาพของสัตว์เลี้ยงในหน้าโปรไฟล์สัตว์เลี้ยง

# vaccinationRequirement
source: Rabies vaccination proof uploaded in your pet profile (within 48 hours after first check in)
th: หลักฐานการฉีดวัคซีนพิษสุนัขบ้าในหน้าโปรไฟล์สัตว์เลี้ยง (อัปโหลดภายใน 48 ชั่วโมงหลังเช็คอินครั้งแรก)

# missingInfo
source: Missing information
th: ข้อมูลเช็คอินยังไม่ครบ

source: Pet Photo
th: รูปภาพสัตว์เลี้ยง

# mandatoryPetPhoto
source: Please upload the photo in your Pet Profile inorder to access the Smart Check-In.
th: โปรดอัปโหลดรูปภาพสัตว์เลี้ยงลงในโปรไฟล์เพื่อใช้สมาร์ทเช็คอิน

# rabiesWarning1
source: To use our Smart Check-In, you must provide Rabies vaccination date and certificate. If you don’t currently have these details, you have 48 hours to upload them to your pet profile.
th: โปรดอัปโหลดหลักฐานการฉีดวัคซีนพิษสุนัข บ้าของสัตว์เลี้ยงพร้อมแจ้งวันที่ฉีด หากไม่มี ข้อมูลเบื้องต้นนี้ คุณมีเวลา 48 ชั่วโมง หลังจากการเช็คอินครั้งแรกเพื่ออัปโหลด

# missingRabies
source: Missing rabies vaccine
th: ขาดหลักฐานการฉีดวัคซีน

# rabiesWarning2
source: To use our Smart Check-In you need to provide Rabies vaccination date and certificate. If you don’t have these details with you now you have 48 hours to upload them in your pet profile.
th: เพื่อใช้สมาร์ทเช็คอินคุณต้องอัปโหลดหลักฐานการฉีดวัคซีนพิษสุนัขบ้าของสัตว์เลี้ยงพร้อมแจ้งวันที่ฉีด หากไม่มีข้อมูลเบื้องต้นนี้ คุณมีเวลา 48 ชั่วโมงเพื่ออัปโหลดลงโปรไฟล์สัตว์เลี้ยง

# addMissing
source: Add Missing Details
th: เพิ่มรายละเอียดที่ขาดหายไป

# continueButton
source: Continue
th: ดำเนินการต่อ

# missingRabiesProof
source: Missing rabies vaccine proof
th: ขาดหลักฐานการฉีดวัคซีน

# mustRabies
source: To use our Smart Check-In, you must provide Rabies vaccination date and certificate.
th: เพื่อใช้สมาร์ทเช็คอินคุณต้องอัปโหลดหลักฐานการฉีดวัคซีนพิษสุนัขบ้าของสัตว์เลี้ยง พร้อมแจ้งวันที่ฉีด

source: Okay
th: โอเค

# missingInfoShort
source: Missing Information
th: ข้อมูลไม่ครบ

source: Update Vaccination
th: อัปเดตวัคซีน

source: Pet Alert
th: เพ็ทอะเลิร์ท (Pet Alert)

# lostPet
source: Lost a pet
th: สัตว์เลี้ยงหาย

# weLostaPet
source: My Pet Went Missing!
th: สัตว์เลี้ยงฉันหาย

# weFoundaPet
source: I Found a Pet!
th: เราพบสัตว์เลี้ยง

source: Sort by
th: เรียงตาม

# noPetsListed
source: No pets listed here at the moment
th: ไม่มีสัตว์เลี้ยง ณ ขณะนี้

# alertOurFriends
source: Alert our friends in the area who might have seen your pet & help the pets find their way home!
th: แจ้งเตือนเพื่อนของเราในพื้นที่ที่อาจเห็นสัตว์เลี้ยงของคุณ และช่วยให้น้อง ๆ ได้กลับบ้าน!

source: Select your pet
th: เลือกสัตว์เลี้ยง

source: Last seen at
th: พบเห็นครั้งสุดท้ายที่

source: Contact the owner
th: ติดต่อเจ้าของ

source: Contact the finder
th: ติดต่อผู้ค้นพบ

source: My activity
th: กิจกรรมของฉัน

# allPets
source: All
th: สัตว์เลี้ยงทั้งหมด

# lostPets
source: Lost
th: หาย

# foundPets
source: Found
th: พบเจอ

# thanks
source: Thank you
th: ขอบคุณมากนะ!

# pleaseFillAll
source: Please fill in all the required fields.
th: กรุณากรอกข้อมูลในช่องที่ต้องกรอกทั้งหมด

# missingPetsB
source: missing pets
th: สัตว์เลี้ยงหาย

# foundPetsB
source: Found pets
th: สัตว์เลี้ยงที่เจอ

source: Add ''lost pet'' listing
th: เพิ่มโพสต์ ''สัตว์เลี้ยงหาย''

source: Add ''found pet'' listing
th: เพิ่มโพสต์ ''เจอสัตว์เลี้ยง''

source: Pet Details
th: รายละเอียดสัตว์เลี้ยง

# youHaveFound
source: You've found a lost friend! We're here to help you get them home.
th: คุณได้พบเพื่อนมากมาย

# letsGetThem
source: Let's get them home.
th: มารับพวกเขากลับบ้านกันเถอะ

source: No results found
th: ไม่พบผลลัพธ์

source: Confirm location
th: ยืนยันตำแหน่ง

# searchLocation
source: Search for a location
th: ค้นหาสถานที่

source: Location
th: ที่ตั้ง

source: results
th: ผลลัพธ์

source: Reward
th: รางวัล

# weWillSend
source: We will send a notification to the owner and let them know you have information about the pet.
th: เราจะส่งการแจ้งเตือนไปยังเจ้าของและแจ้งให้พวกเขาทราบว่าคุณมีข้อมูลเกี่ยวกับสัตว์เลี้ยง

# onlyTheMain
source: Only the main details are mandatory, once added you can add more pet facts later.
th: เฉพาะรายละเอียดหลักเท่านั้นที่จำเป็น เมื่อเพิ่มแล้ว คุณสามารถเพิ่มข้อมูลสัตว์เลี้ยงเพิ่มเติมได้ในภายหลัง

source: Results found
th: ผลลัพธ์ที่พบ

source: Distance
th: ระยะทาง

source: Recently added
th: เพิ่มใหม่

# sortByDefault
source: Default
th: ค่าเริ่มต้น

source: Edit post
th: แก้ไขโพสต์

source: Delete post
th: ลบโพสต์

source: Delete ''lost pet'' Post
th: ลบโพสต์ ''สัตว์เลี้ยงหาย''

source: Delete ''found pet'' Post
th: ลบโพสต์ ''เจอสัตว์เลี้ยง''

# deletePostMessage
source: Are you sure you want to remove this post? You cannot undo this action
th: แน่ใจนะว่าต้องการลบโพสต์นี้ คุณไม่สามารถเลิกการลบได้

# editLostPet
source: Edit ''lost pet'' listing
th: แก้ไขโพสต์ ''สัตว์เลี้ยงหาย''

# editFoundPet
source: Edit ''found pet'' listing
th: แก้ไขโพสต์ ''เจอสัตว์เลี้ยง''

# lostPetPost
source: We’re here to help you find your friend! Fill out the following details so everyone can keep an eye out.
th: ให้เราช่วย ‘เพิ่มโอกาส’ ในการตามหาเจ้าน้อง สัตว์เลี้ยงเจอ กรอกรายละเอียดและข้อมูลต่อไปนี้ เพื่อนๆจะได้ช่วยหาน้องกันนะ

# foundPetPost
source: You’ve found a lost friend! We’re here to help you get them home.
th: เจอน้องสัตว์เลี้ยงหลงทางหรอ ให้เราช่วยพาน้องกลับบ้านกัน!

source: SAVE CHANGE
th: บันทึกการเปลี่ยนแปลง

source: CHECK HERE!
th: ลงประกาศที่นี่

# petAlertShortDescription
source: Have you lost or found a pet?
th: พบสัตว์เลี้ยง หรือสัตว์เลี้ยง สูญหาย

# petAlertNoPet
source: Oh no! You haven't created a pet profile yet, or your pet has already been listed.
th: ไม่นะ! คุณยังไม่ได้สร้างโปรไฟล์สัตว์เลี้ยง หรือได้ประกาศสัตว์เลี้ยงหายไปแล้ว

# petAlertNoPetContinue
source: Create your pet profile to proceed, or check your pet's listing in My Activity.
th: สร้างโปรไฟล์สัตว์เลี้ยงเพื่อดำเนินการต่อ หรือตรวจสอบโพสต์ของคุณได้ที่หน้ากิจกรรมของฉัน

source: Checking Out?
th: ต้องการเช็คเอ้าท์เหรอ?

# areYouLeaving
source: Are you leaving? Check out your pets by tapping the confirm button below.
th: จะกลับบ้านแล้วใช่มั้ย? เช็คเอ้าท์โดยการกดปุ่มยืนยันด้านล่าง
